//#include <iostream>
//using namespace std;
//
//int main()
//{
//	////第一种定义方式
//	////数据类型 数组名[元素个数];
//	//int score[10];
//
//	////利用下标进行赋值
//	//score[0] = 10;
//	//score[1] = 20;
//	//score[2] = 30;
//	//score[3] = 40;
//
//	////利用下标输出
//	//cout << score[0] << endl;
//	//cout << score[1] << endl;
//	//cout << score[2] << endl;
//	//cout << score[3] << endl;
//
//	////第二种定义方式
//	////数据类型 数组名[元素个数] = {值1，值2，值3 ...};
//	////如果{}内的值不足元素个数，则剩余的值将会用0补齐
//	//int score2[10] = { 90,80,70,60,50,40,30 };
//
//	//////逐个输出
//	////cout << score2[0] << endl;
//	////cout << score2[1] << endl;
//	////cout << score2[2] << endl;
//
//	////逐个输出太过麻烦，利用for循环进行输出
//	//for (int i = 0; i < 10; i++)
//	//{
//	//	cout << score2[i] << endl;
//	//}
//
//	//第三种定义方式
//	//数据类型 数组名[] = {值1，值2，值3, ...};
//	int score3[] = {100,90,80,70,60,50,40,30,20,10};
//
//	for (int i = 0; i < 10; i++)
//	{
//		cout << score3[i] << endl;
//	}
//
//	//总结1:数组名不能和变量名重复
//	//总结2:数组中的下标是从0开始索引
//
//
//	system("pause");
//	return 0;
//}